---
title: ProgressChangedEventArgs
classe: Autodesk.Revit.DB.Events.ProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ProgressChangedEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Caption { get; }` | `progressChangedEventArgs.Caption` | String |
| `Int32 LowerRange { get; }` | `progressChangedEventArgs.LowerRange` | Int32 |
| `Int32 Position { get; }` | `progressChangedEventArgs.Position` | Int32 |
| `ProgressStage Stage { get; }` | `progressChangedEventArgs.Stage` | ProgressStage |
| `Int32 UpperRange { get; }` | `progressChangedEventArgs.UpperRange` | Int32 |
| `Void Cancel()` | `progressChangedEventArgs.Cancel()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```